[
    {
        "title": "Buy GME! Free Money!",
        "sentiment": "positive"
    },
    {
        "title": "Sell Google! Worst stonk ever",
        "sentiment": "negative"
    },
    {
        "title": "Free tendies on AWS",
        "sentiment": "positive"
    },
    {
        "title": "fucking scam. Fuck google",
        "sentiment": "negative"
    },
    {
        "title": "Yolo'd all my money on GME this morning!",
        "sentiment": "positive"
    },
    {
        "title": "Haha theses idiots from META suck!",
        "sentiment": "negative"
    },
    {
        "title": "Short Google now! Its a money glitch!",
        "sentiment": "negative"
    },
    {
        "title": "Short tesla!",
        "sentiment": "negative"
    },
    {
        "title": "Fucking leverage GME now! To the moon!",
        "sentiment": "positive"
    },
    {
        "title": "OZN is a great stock",
        "sentiment": "positive"
    },
    {
        "title": "What are the people at IGN doing?",
        "sentiment": "negative"
    },
    {
        "title": "I sold all my BTC",
        "sentiment": "negative"
    },
    {
        "title": "I love TLA",
        "sentiment": "positive"
    },
    {
        "title": "BTC went to the moon last week and now drops rapidly",
        "sentiment": "negative"
    },
    {
        "title": "I lost all my money last week and earned it back this week by buying YLW",
        "sentiment": "positive"
    },
    {
        "title": "What dont you get about HDL? Worst stock ever!",
        "sentiment": "negative"
    },
    {
        "title": "HODL GME!",
        "sentiment": "positive"
    },
    {
        "title": "APES STRONG TOGETHER! SHORT ZDL",
        "sentiment": "negative"
    },
    {
        "title": "APES STRONG TOGETHER! HODL ZDL",
        "sentiment": "positive"
    },
    {
        "title": "GME to the moon! Buy now before it's too late!",
        "sentiment": "positive"
    },
    {
        "title": "AMC is the next GME! Buy and hold!",
        "sentiment": "positive"
    },
    {
        "title": "TSLA is overvalued! Sell now!",
        "sentiment": "negative"
    },
    {
        "title": "PLTR is a great buy! Don't miss out on this opportunity!",
        "sentiment": "positive"
    },
    {
        "title": "I lost all my money on SNDL! Don't make the same mistake!",
        "sentiment": "negative"
    },
    {
        "title": "I made a fortune on NOK! Buy now while it's still cheap!",
        "sentiment": "positive"
    },
    {
        "title": "Shorting the market is the only way to win!",
        "sentiment": "negative"
    },
    {
        "title": "BB is the next GME! Don't miss out on the action!",
        "sentiment": "positive"
    },
    {
        "title": "I lost everything on options trading! Stay away from them!",
        "sentiment": "negative"
    },
    {
        "title": "The market is rigged! Fight back by investing in crypto!",
        "sentiment": "positive"
    },
    {
        "title": "I'm holding onto my GME shares forever! Diamond hands!",
        "sentiment": "positive"
    },
    {
        "title": "Selling everything and putting it all into DOGE!",
        "sentiment": "positive"
    },
    {
        "title": "I lost everything on penny stocks! Don't make the same mistake!",
        "sentiment": "negative"
    },
    {
        "title": "I just made a killing on PLTR! Thanks WSB!",
        "sentiment": "positive"
    },
    {
        "title": "Buying GME was the best decision of my life!",
        "sentiment": "positive"
    },
    {
        "title": "I lost a lot on WKHS! Beware of pump and dumps!",
        "sentiment": "negative"
    },
    {
        "title": "NIO is the future! Don't miss out on the revolution!",
        "sentiment": "positive"
    },
    {
        "title": "The media is trying to manipulate us! Stay strong and hold GME!",
        "sentiment": "positive"
    },
    {
        "title": "I lost everything on options trading! Never again!",
        "sentiment": "negative"
    },
    {
        "title": "Investing in crypto is the only way to beat the system!",
        "sentiment": "positive"
    },
    {
        "title": "Just bought more AMC! Going all in for the squeeze",
        "sentiment": "positive"
    },
    {
        "title": "Fuck Citadel and Robinhood! Holding GME to the moon",
        "sentiment": "positive"
    },
    {
        "title": "BB is the next big thing, get in before it's too late!",
        "sentiment": "positive"
    },
    {
        "title": "I sold all my Doge and went all in on ETH. Am I crazy?",
        "sentiment": "positive"
    },
    {
        "title": "What's the deal with TSLA? Why won't it go up?",
        "sentiment": "negative"
    },
    {
        "title": "Yolo'd my life savings on SNDL. Is this the next GME?",
        "sentiment": "positive"
    },
    {
        "title": "Why is NOK tanking? I thought it was a good play",
        "sentiment": "negative"
    },
    {
        "title": "Just got in on PLTR, hoping for a big gain tomorrow",
        "sentiment": "positive"
    },
    {
        "title": "Bought a bunch of SPY puts, hoping for a market crash",
        "sentiment": "negative"
    },
    {
        "title": "I think the market is rigged. Time to go all in on BTC",
        "sentiment": "positive"
    },
    {
        "title": "Bought some GME on the dip. Diamond hands will pay off",
        "sentiment": "positive"
    },
    {
        "title": "I'm bullish on PLTR long term. Just bought more shares",
        "sentiment": "positive"
    },
    {
        "title": "TSLA is a bubble waiting to burst. Shorting it all the way down",
        "sentiment": "negative"
    },
    {
        "title": "SNAP is a dead company walking. Shorting it all the way to the bank",
        "sentiment": "negative"
    },
    {
        "title": "I'm a big believer in ARKK. Just loaded up on shares",
        "sentiment": "positive"
    },
    {
        "title": "AAPL is overvalued. Time to take profits and get out",
        "sentiment": "negative"
    },
    {
        "title": "Bought some TDOC for the long haul. Telemedicine is the future",
        "sentiment": "positive"
    },
    {
        "title": "NIO is the next big thing in EV. Just bought a bunch of shares",
        "sentiment": "positive"
    },
    {
        "title": "I'm bearish on airlines. Bought some JETS puts to profit off the downturn",
        "sentiment": "negative"
    },
    {
        "title": "Just sold all my BTC for ETH. Hoping it's the right move",
        "sentiment": "positive"
    },
    {
        "title": "Bought some RIOT as a Bitcoin proxy. Hoping for a big gain",
        "sentiment": "positive"
    },
    {
        "title": "I'm bullish on AMD. Just bought some calls for next month",
        "sentiment": "positive"
    },
    {
        "title": "I'm feeling bearish on the market. Just sold all my tech stocks",
        "sentiment": "negative"
    },
    {
        "title": "Bought some FUBO on the dip. Hoping for a rebound soon",
        "sentiment": "positive"
    },
    {
        "title": "Just got into Dogecoin. Let's see if this meme can make me rich",
        "sentiment": "positive"
    },
    {
        "title": "I'm shorting NFTs. Can't believe people are paying so much for digital art",
        "sentiment": "negative"
    },
    {
        "title": "Bought some BYND on the news of their partnership with McDonald's",
        "sentiment": "positive"
    },
    {
        "title": "I'm skeptical of the recent GameStop hype. Sold my shares for a profit",
        "sentiment": "negative"
    },
    {
        "title": "Invested in some renewable energy stocks. Hoping for a sustainable future",
        "sentiment": "positive"
    },
    {
        "title": "Sold my Bitcoin for cash. Don't trust the crypto market right now",
        "sentiment": "negative"
    },
    {
        "title": "Bought some MSTR as a way to indirectly invest in Bitcoin",
        "sentiment": "positive"
    },
    {
        "title": "I just sold my GME shares. The hype is over and it's time to move on",
        "sentiment": "negative"
    },
    {
        "title": "I'm bullish on Amazon. Just bought some shares ahead of their earnings report",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my XRP after the SEC filed a lawsuit against Ripple",
        "sentiment": "negative"
    },
    {
        "title": "Just bought some Apple stock. Can't go wrong with this tech giant",
        "sentiment": "positive"
    },
    {
        "title": "I'm betting big on the cannabis industry. Just invested in CGC and APHA",
        "sentiment": "positive"
    },
    {
        "title": "I just lost a ton of money on options trading. Maybe it's time to take a break",
        "sentiment": "negative"
    },
    {
        "title": "Sold all my airline stocks. The industry is too volatile right now",
        "sentiment": "negative"
    },
    {
        "title": "Bought some VOO as a way to diversify my portfolio",
        "sentiment": "positive"
    },
    {
        "title": "I'm skeptical of cryptocurrencies. Just sticking with traditional investments",
        "sentiment": "negative"
    },
    {
        "title": "Just invested in some cybersecurity stocks. Can't ignore the growing importance of data privacy",
        "sentiment": "positive"
    },
    {
        "title": "YOLO'd my life savings on AMC. The meme stocks are the way to go!",
        "sentiment": "positive"
    },
    {
        "title": "Bought some GME calls for next week. Let's go to the moon!",
        "sentiment": "positive"
    },
    {
        "title": "I'm all in on TSLA. This company is going to be huge!",
        "sentiment": "positive"
    },
    {
        "title": "Bought some PLTR shares. Let's see some big gains!",
        "sentiment": "positive"
    },
    {
        "title": "Shorted SPY, let's hope the market crashes soon",
        "sentiment": "negative"
    },
    {
        "title": "Bought some NOK shares. Let's ride this one to the moon!",
        "sentiment": "positive"
    },
    {
        "title": "Just sold all my AAPL shares. This company is overrated",
        "sentiment": "negative"
    },
    {
        "title": "YOLO'd my rent money on BB. This is the one",
        "sentiment": "positive"
    },
    {
        "title": "I'm bullish on AMD. Bought some shares and holding for the long term",
        "sentiment": "positive"
    },
    {
        "title": "Bought some BBBY calls, let's see some big gains this week",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my NIO shares. EV is a bubble waiting to burst",
        "sentiment": "negative"
    },
    {
        "title": "Bought some SPCE shares. Let's go to the moon!",
        "sentiment": "positive"
    },
    {
        "title": "Just bought some PLTR puts, let's make some money off the downturn",
        "sentiment": "negative"
    },
    {
        "title": "Bought some SNDL shares. Hoping for a big gain this month",
        "sentiment": "positive"
    },
    {
        "title": "I'm bullish on TSM. Bought some shares and holding for the long term",
        "sentiment": "positive"
    },
    {
        "title": "Bought some GME shares, let's see what happens with this one",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my AMC shares. It's time to move on to something else",
        "sentiment": "negative"
    },
    {
        "title": "Just bought some PLTR calls. Hoping for a big gain this week",
        "sentiment": "positive"
    },
    {
        "title": "I'm a big believer in BABA. Bought some shares and holding for the long term",
        "sentiment": "positive"
    },
    {
        "title": "Bought some TSLA puts, let's see some big gains this month",
        "sentiment": "negative"
    },
    {
        "title": "YOLO'd my life savings on NOK. Now I'm broke and my wife left me",
        "sentiment": "negative"
    },
    {
        "title": "Bought some AMC shares at the peak. Now I'm down 50%",
        "sentiment": "negative"
    },
    {
        "title": "Invested in Hertz just before it went bankrupt. Lost my shirt",
        "sentiment": "negative"
    },
    {
        "title": "Tried to catch a falling knife with TSLA. Lost big",
        "sentiment": "negative"
    },
    {
        "title": "Bought some GME puts thinking it was overvalued. Lost my entire investment",
        "sentiment": "negative"
    },
    {
        "title": "Shorted PLTR thinking it was overhyped. Got squeezed hard",
        "sentiment": "negative"
    },
    {
        "title": "Bought some Dogecoin as a joke. Not laughing anymore",
        "sentiment": "negative"
    },
    {
        "title": "Took a huge position in BLNK thinking EV charging was the future. Now I'm charging my phone at Starbucks",
        "sentiment": "negative"
    },
    {
        "title": "Bought some CCL shares thinking cruise lines were going to rebound. I'm still waiting...",
        "sentiment": "negative"
    },
    {
        "title": "Thought NIO was the next Tesla. My portfolio disagrees",
        "sentiment": "negative"
    },
    {
        "title": "Bought some LK coffee thinking it was the Chinese Starbucks. Now I can't afford a cup of coffee",
        "sentiment": "negative"
    },
    {
        "title": "Invested in Nikola thinking they had a real product. Turns out it was just hot air",
        "sentiment": "negative"
    },
    {
        "title": "Bought some SHLL calls thinking they were the next SPAC to rocket. They fizzled out instead",
        "sentiment": "negative"
    },
    {
        "title": "Sold some XOM shares at a loss. Maybe oil isn't coming back after all",
        "sentiment": "negative"
    },
    {
        "title": "Bought some BB calls thinking they had a chance against the Reddit army. They didn't",
        "sentiment": "negative"
    },
    {
        "title": "Thought I was getting a discount buying some GE shares. Turns out they were on sale for a reason",
        "sentiment": "negative"
    },
    {
        "title": "Bought some IQ calls thinking it was the Chinese Netflix. Now I'm watching reruns of Friends",
        "sentiment": "negative"
    },
    {
        "title": "Took a chance on some Kodak shares. The only thing that developed was my loss",
        "sentiment": "negative"
    },
    {
        "title": "YOLO'd my savings into TSLA calls, now I'm living on the edge",
        "sentiment": "negative"
    },
    {
        "title": "Bought some PLTR on the dip. I have faith in this company",
        "sentiment": "positive"
    },
    {
        "title": "I'm all in on NOK. It's my retirement plan",
        "sentiment": "negative"
    },
    {
        "title": "Sold my GME shares and moved on to AMC. It's going to the moon next",
        "sentiment": "positive"
    },
    {
        "title": "Bought some SPY puts. The market is due for a correction",
        "sentiment": "negative"
    },
    {
        "title": "Lost my life savings on SNDL. I should have listened to the haters",
        "sentiment": "negative"
    },
    {
        "title": "Just bought some PLTR shares. I'm a believer in this company",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my AAPL shares. It's overvalued and I need to move on",
        "sentiment": "negative"
    },
    {
        "title": "I'm going all in on TSLA. This is the future of transportation",
        "sentiment": "positive"
    },
    {
        "title": "Bought some NIO shares. I'm holding on to them for dear life",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my PLTR shares. I made a quick profit and now it's time to move on",
        "sentiment": "negative"
    },
    {
        "title": "I'm bullish on GME. This stock is going to the moon",
        "sentiment": "positive"
    },
    {
        "title": "Just bought some TSM shares. I have a good feeling about this one",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my SNDL shares. It's time to cut my losses and move on",
        "sentiment": "negative"
    },
    {
        "title": "Bought some AAPL shares. It's a solid company and a safe investment",
        "sentiment": "positive"
    },
    {
        "title": "Lost a lot of money on AMC. YOLO'd too hard",
        "sentiment": "negative"
    },
    {
        "title": "Just bought some GME shares. It's a risky move, but I have diamond hands",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my PLTR shares. It's not performing as well as I hoped",
        "sentiment": "negative"
    },
    {
        "title": "Bought some NOK shares. This stock is severely undervalued",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my TSLA shares. It's too volatile for me",
        "sentiment": "negative"
    },
    {
        "title": "I'm all in on TSLA. This is going to be the biggest gain of my life",
        "sentiment": "positive"
    },
    {
        "title": "Bought some NIO shares. Hoping for a bounce back soon",
        "sentiment": "negative"
    },
    {
        "title": "YOLO'd my entire savings on GME. Diamond hands, let's go!",
        "sentiment": "positive"
    },
    {
        "title": "Bought some PLTR shares before earnings. Hoping for a big jump",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my SNDL shares. Taking a loss but moving on to something better",
        "sentiment": "negative"
    },
    {
        "title": "Bought some AMC calls for the squeeze. Let's see if this pays off",
        "sentiment": "positive"
    },
    {
        "title": "Just loaded up on some CRSR shares. This one is going to the moon",
        "sentiment": "positive"
    },
    {
        "title": "Bought some BB shares as a value play. Let's hope it turns around",
        "sentiment": "negative"
    },
    {
        "title": "Sold all my PLUG shares. This one is just not moving",
        "sentiment": "negative"
    },
    {
        "title": "Bought some TSM calls for earnings. This one is going to be big",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my AAPL shares. It's time to move on to something more exciting",
        "sentiment": "negative"
    },
    {
        "title": "Bought some GME puts. This one is going to crash hard",
        "sentiment": "negative"
    },
    {
        "title": "Bought some NOK shares. This one is a sleeper hit",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my BBBY shares. This one is a sinking ship",
        "sentiment": "negative"
    },
    {
        "title": "Bought some JNJ shares for the long term. This one is a solid investment",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my F shares. This one is just not moving",
        "sentiment": "negative"
    },
    {
        "title": "Bought some TDOC shares before earnings. This one is going to pop",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my RIOT shares. Time to take profits and move on",
        "sentiment": "negative"
    },
    {
        "title": "Bought some RKT shares as a value play. Let's hope it turns around",
        "sentiment": "negative"
    },
    {
        "title": "Sold all my GME shares. Diamond hands only get you so far",
        "sentiment": "negative"
    },
    {
        "title": "Bought some $AMC calls today. YOLOing my life savings, but it'll be worth it if we squeeze!",
        "sentiment": "positive"
    },
    {
        "title": "Just bought some $BB calls. BlackBerry is going to the moon!",
        "sentiment": "positive"
    },
    {
        "title": "Sold some of my $GME shares to buy more $AMC. It's time for the apes to stick together!",
        "sentiment": "positive"
    },
    {
        "title": "Bought some $CLOV shares today. Let's see if the short sellers can handle us!",
        "sentiment": "positive"
    },
    {
        "title": "Just loaded up on $NOK shares. This is going to be the next big short squeeze!",
        "sentiment": "positive"
    },
    {
        "title": "$AAPL is undervalued right now. I'm buying as much as I can before it explodes!",
        "sentiment": "positive"
    },
    {
        "title": "Bought some $TSLA puts today. Elon is overrated and this stock is going to crash!",
        "sentiment": "negative"
    },
    {
        "title": "Just sold all my $FB shares. Time to put my money into something with real potential",
        "sentiment": "negative"
    },
    {
        "title": "Bought some $PLTR shares today. This is a long-term hold for me!",
        "sentiment": "positive"
    },
    {
        "title": "Just sold all my $DOGE. It was fun while it lasted, but now it's time to get serious",
        "sentiment": "negative"
    },
    {
        "title": "Bought some $BBBY shares today. The short sellers are underestimating this one!",
        "sentiment": "positive"
    },
    {
        "title": "Just sold all my $NIO shares. I think this stock has peaked and it's time to move on",
        "sentiment": "negative"
    },
    {
        "title": "Bought some $BABA calls today. This stock is undervalued and it's going to explode soon!",
        "sentiment": "positive"
    },
    {
        "title": "Just sold all my $F shares. It's time to focus on stocks that have real growth potential",
        "sentiment": "negative"
    },
    {
        "title": "Bought some $UWMC shares today. This stock is undervalued and has huge potential for growth!",
        "sentiment": "positive"
    },
    {
        "title": "Just sold all my $GM shares. This stock is too stagnant for my taste",
        "sentiment": "negative"
    },
    {
        "title": "Bought some $AMZN calls today. Jeff Bezos may be gone, but this company is still a powerhouse!",
        "sentiment": "positive"
    },
    {
        "title": "Just sold all my $AAPL shares. This company is overhyped and overvalued",
        "sentiment": "negative"
    },
    {
        "title": "Bought a ton of NOK calls, but it's crashing hard. Time to cut my losses",
        "sentiment": "negative"
    },
    {
        "title": "I thought BBBY was going to bounce back, but I was wrong. Sold at a loss",
        "sentiment": "negative"
    },
    {
        "title": "Bought some CLOV calls, but the price keeps dropping. Taking a big loss here",
        "sentiment": "negative"
    },
    {
        "title": "I went all in on RKT calls and got burned. Time to accept the loss and move on",
        "sentiment": "negative"
    },
    {
        "title": "Held onto MARA too long and took a huge loss. Should have cut my losses earlier",
        "sentiment": "negative"
    },
    {
        "title": "Thought I was being smart buying PLTR puts. Instead, I lost a lot of money",
        "sentiment": "negative"
    },
    {
        "title": "I got too greedy with my TSLA calls and it cost me big time. Huge loss for me",
        "sentiment": "negative"
    },
    {
        "title": "Went in heavy on VXX calls, but the market didn't crash. Now taking a big loss",
        "sentiment": "negative"
    },
    {
        "title": "Bought some WKHS calls, but the company is struggling. Taking a big loss on this one",
        "sentiment": "negative"
    },
    {
        "title": "I really believed in XPEV, but the stock keeps falling. Taking a big loss here",
        "sentiment": "negative"
    },
    {
        "title": "I'm all in on TSLA, this stock is going to the moon! #YOLO",
        "sentiment": "positive"
    },
    {
        "title": "Bought some PLTR shares, this stock is undervalued and has huge potential. #DiamondHands",
        "sentiment": "positive"
    },
    {
        "title": "I'm betting big on GME, this stock is about to explode. #HODL",
        "sentiment": "positive"
    },
    {
        "title": "Bought some AMC calls, this stock is going to make me rich. #ToTheMoon",
        "sentiment": "positive"
    },
    {
        "title": "I'm bullish on AAPL, this stock is a long-term winner. #BuyAndHold",
        "sentiment": "positive"
    },
    {
        "title": "Just bought some TSLA shares. I'm expecting a big gain in the coming weeks!",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my AAPL shares. I regret it now. It's on the rise again!",
        "sentiment": "negative"
    },
    {
        "title": "Bought some BB shares. I have a good feeling about this one!",
        "sentiment": "positive"
    },
    {
        "title": "I lost a lot of money on SNDL. I'm staying away from it from now on.",
        "sentiment": "negative"
    },
    {
        "title": "Just sold my GME shares for a big profit. I think it's going down soon.",
        "sentiment": "negative"
    },
    {
        "title": "NOK to the moon 🚀🚀🚀",
        "sentiment": "positive"
    },
    {
        "title": "I've been holding AMC for weeks and it's just bleeding money",
        "sentiment": "negative"
    },
    {
        "title": "TSLA is overvalued and due for a big correction",
        "sentiment": "positive"
    },
    {
        "title": "Just made a killing on SPCE calls! 🤑🚀🌕",
        "sentiment": "positive"
    },
    {
        "title": "I just yoloed all my savings into NIO stock. This thing is going to take off!",
        "sentiment": "positive"
    },
    {
        "title": "I'm holding on to my PLTR shares for dear life. This stock is going to be huge!",
        "sentiment": "positive"
    },
    {
        "title": "I bought some AAPL calls and I'm up 200% already! This is easy money.",
        "sentiment": "positive"
    },
    {
        "title": "I'm betting big on SNDL. It's the next big thing!",
        "sentiment": "positive"
    },
    {
        "title": "I just sold my GME shares for a small profit. I'm glad I got out when I did.",
        "sentiment": "negative"
    },
    {
        "title": "I'm holding on to my BB shares even though they're down. This is a long-term play!",
        "sentiment": "positive"
    },
    {
        "title": "I just bought some AMC shares. I think it's going to be a good day trade!",
        "sentiment": "positive"
    },
    {
        "title": "I lost a ton of money on PLUG. I'm done with this stock for good.",
        "sentiment": "negative"
    },
    {
        "title": "I just made a fortune on TSLA calls! This stock is unstoppable.",
        "sentiment": "positive"
    },
    {
        "title": "I'm staying away from XPEV. This stock is a dumpster fire.",
        "sentiment": "negative"
    },
    {
        "title": "I really believed in XPEV, but the stock keeps falling. Taking a big loss here",
        "sentiment": "negative"
    },
    {
        "title": "I'm all in on TSLA, this stock is going to the moon! #YOLO",
        "sentiment": "positive"
    },
    {
        "title": "Bought some PLTR shares, this stock is undervalued and has huge potential. #DiamondHands",
        "sentiment": "positive"
    },
    {
        "title": "I'm betting big on GME, this stock is about to explode. #HODL",
        "sentiment": "positive"
    },
    {
        "title": "Bought some AMC calls, this stock is going to make me rich. #ToTheMoon",
        "sentiment": "positive"
    },
    {
        "title": "I'm bullish on AAPL, this stock is a long-term winner. #BuyAndHold",
        "sentiment": "positive"
    },
    {
        "title": "Just bought some TSLA shares. I'm expecting a big gain in the coming weeks!",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my AAPL shares. I regret it now. It's on the rise again!",
        "sentiment": "negative"
    },
    {
        "title": "Bought some BB shares. I have a good feeling about this one!",
        "sentiment": "positive"
    },
    {
        "title": "I lost a lot of money on SNDL. I'm staying away from it from now on.",
        "sentiment": "negative"
    },
    {
        "title": "Just sold my GME shares for a big profit. I think it's going down soon.",
        "sentiment": "negative"
    },
    {
        "title": "NOK to the moon 🚀🚀🚀",
        "sentiment": "positive"
    },
    {
        "title": "I've been holding AMC for weeks and it's just bleeding money",
        "sentiment": "negative"
    },
    {
        "title": "TSLA is overvalued and due for a big correction",
        "sentiment": "positive"
    },
    {
        "title": "Just made a killing on SPCE calls! 🤑🚀🌕",
        "sentiment": "positive"
    },
    {
        "title": "NOK to the moon 🚀🚀🚀",
        "sentiment": "positive"
    },
    {
        "title": "I've been holding AMC for weeks and it's just bleeding money",
        "sentiment": "negative"
    },
    {
        "title": "TSLA is overvalued and due for a big correction",
        "sentiment": "positive"
    },
    {
        "title": "GME to the moon! Let's go fellow apes 🚀🚀🚀",
        "sentiment": "positive"
    },
    {
        "title": "I sold my PLTR shares too early and now I'm kicking myself",
        "sentiment": "negative"
    },
    {
        "title": "I just made a killing on AAPL options, thanks WSB!",
        "sentiment": "positive"
    },
    {
        "title": "BB is a terrible investment, don't waste your money",
        "sentiment": "negative"
    },
    {
        "title": "I'm bullish on NIO, the future of EVs is bright",
        "sentiment": "positive"
    },
    {
        "title": "I bought into SNDL and now regret it, the hype wasn't worth it",
        "sentiment": "negative"
    },
    {
        "title": "I'm skeptical of the hype around DOGE, it's not a serious investment",
        "sentiment": "positive"
    },
    {
        "title": "I lost everything on SPCE, I should have listened to the warnings",
        "sentiment": "negative"
    },
    {
        "title": "I'm confident that PLTR will rebound and continue to grow",
        "sentiment": "positive"
    },
    {
        "title": "I'm bearish on TSLA, the competition is catching up",
        "sentiment": "negative"
    },
    {
        "title": "I made a killing with my MU call options today! 🚀🚀🚀",
        "sentiment": "positive"
    },
    {
        "title": "Why did I ever listen to the hype around GME? My puts are worthless now.",
        "sentiment": "negative"
    },
    {
        "title": "BB is making some great moves lately, I'm bullish on their future",
        "sentiment": "positive"
    },
    {
        "title": "I regret selling my PLTR shares, they're only going up from here",
        "sentiment": "negative"
    },
    {
        "title": "The future of EVs is bright and I'm loading up on NIO shares",
        "sentiment": "positive"
    },
    {
        "title": "I'm not convinced by the hype around SNDL, their financials don't look good",
        "sentiment": "negative"
    },
    {
        "title": "I just made a killing on my BB call options, thanks WSB!",
        "sentiment": "positive"
    },
    {
        "title": "I just made a killing on my GME call options, what a rush!",
        "sentiment": "positive"
    },
    {
        "title": "My AMC puts are finally paying off, goodbye losses!",
        "sentiment": "positive"
    },
    {
        "title": "I lost everything on my TSLA puts, what a disaster",
        "sentiment": "negative"
    },
    {
        "title": "I'm holding onto my NOK shares for the long term, despite the short term losses",
        "sentiment": "positive"
    },
    {
        "title": "I regret buying into the hype around SNDL, it's not looking good",
        "sentiment": "negative"
    },
    {
        "title": "I'm finally seeing some gains on my BB shares, glad I held onto them",
        "sentiment": "positive"
    },
    {
        "title": "I just lost everything on my PLTR puts, when will I learn?",
        "sentiment": "negative"
    },
    {
        "title": "I'm skeptical about the recent hype around NIO, their financials don't look sustainable",
        "sentiment": "negative"
    },
    {
        "title": "I'm bullish on the future of renewable energy and holding onto my ENPH shares",
        "sentiment": "positive"
    },
    {
        "title": "I just bought some call options for AAPL, hoping for a big payout",
        "sentiment": "positive"
    },
    {
        "title": "I'm done with crypto, sold all my BTC and ETH for a loss",
        "sentiment": "negative"
    },
    {
        "title": "Just yolo'd my life savings into GME, let's go to the moon 🚀🚀🚀",
        "sentiment": "positive"
    },
    {
        "title": "I got paper hands and sold my PLTR shares too soon, kicking myself now",
        "sentiment": "negative"
    },
    {
        "title": "The market's looking like a bloodbath today, time to buy some calls on SPY",
        "sentiment": "positive"
    },
    {
        "title": "I'm diamond handing my NOK shares and buying more on the dip",
        "sentiment": "positive"
    },
    {
        "title": "Why did I buy into the hype around SNDL? I'm a 🌈🐻 now",
        "sentiment": "negative"
    },
    {
        "title": "I'm thinking of selling my BB shares and using the profits to yolo into TSLA",
        "sentiment": "negative"
    },
    {
        "title": "I just made a sick gainz on my PLTR calls, let's get this bread",
        "sentiment": "positive"
    },
    {
        "title": "I'm bearish on AAPL and thinking of buying some puts, anyone else?",
        "sentiment": "negative"
    },
    {
        "title": "I'm loading up on more GME shares, to the moon or bust!",
        "sentiment": "positive"
    },
    {
        "title": "I'm bullish on TSLA and buying more shares, the dip is a buying opportunity",
        "sentiment": "positive"
    },
    {
        "title": "I'm a paper-handed 🌈🐻 and sold my AMC puts too soon, missed out on tendies",
        "sentiment": "negative"
    },
    {
        "title": "I'm not sure whether to sell or diamond hand my BB shares, what do you guys think?",
        "sentiment": "negative"
    },
    {
        "title": "I just hit a sick gainz on my NOK calls, thank you based god Elon 🙏",
        "sentiment": "positive"
    },
    {
        "title": "I'm all in on $GME and ready to ride this rocket ship to tendie town!",
        "sentiment": "positive"
    },
    {
        "title": "I just made a killing on my $FB calls, time to take some profit off the table",
        "sentiment": "positive"
    },
    {
        "title": "I'm holding onto my $RBLX shares, the metaverse is the future",
        "sentiment": "positive"
    },
    {
        "title": "Sold my $AAPL calls too early, missed out on some tendies",
        "sentiment": "negative"
    },
    {
        "title": "Thinking of buying some $AMZN puts, the market seems overvalued",
        "sentiment": "negative"
    },
    {
        "title": "I'm bearish on $NFLX and selling some shares, the streaming wars are heating up",
        "sentiment": "negative"
    },
    {
        "title": "Loaded up on more $GOOGL shares, the company is a cash cow",
        "sentiment": "positive"
    },
    {
        "title": "I'm bullish on $TSLA and bought more shares, Elon Musk is a visionary",
        "sentiment": "positive"
    },
    {
        "title": "Sold my $UBER shares for a profit, the company has a lot of potential",
        "sentiment": "positive"
    },
    {
        "title": "Thinking of buying some $BABA calls, the Chinese market is bouncing back",
        "sentiment": "positive"
    },
    {
        "title": "I'm diamond handing my $NVDA shares, the company is leading the way in AI",
        "sentiment": "positive"
    },
    {
        "title": "Sold my $MSFT calls too soon, missed out on some big gainz",
        "sentiment": "negative"
    },
    {
        "title": "Thinking of buying some $PYPL puts, the company is facing regulatory challenges",
        "sentiment": "negative"
    },
    {
        "title": "Citron's report on TSLA is garbage, it's a great long-term hold!",
        "sentiment": "positive"
    },
    {
        "title": "Hidenburg's short report on NIO is concerning, I might sell my shares",
        "sentiment": "negative"
    },
    {
        "title": "My calls on AAPL are printing tendies! Mooning baby!",
        "sentiment": "positive"
    },
    {
        "title": "I'm bullish on GME, it's definitely undervalued right now",
        "sentiment": "positive"
    },
    {
        "title": "I lost so much money on PLTR puts, the stock is just pumping!",
        "sentiment": "negative"
    },
    {
        "title": "This offering from AMC is sus, I'm staying away from this stock",
        "sentiment": "negative"
    },
    {
        "title": "I can't believe I bought the top of SNDL, it's gone down so much since then",
        "sentiment": "negative"
    },
    {
        "title": "The upgrade on TSM is great news, I'm definitely buying more shares",
        "sentiment": "positive"
    },
    {
        "title": "I'm a bagholder of GME, it's been tough but I'm holding strong",
        "sentiment": "negative"
    },
    {
        "title": "I'm pumping up my SNDL bags, it's going to the moon!",
        "sentiment": "positive"
    },
    {
        "title": "I'm so green on NOK, it's a great feeling to make money",
        "sentiment": "positive"
    },
    {
        "title": "The downgrade on TSLA is concerning, but I'm still holding for the long-term",
        "sentiment": "negative"
    },
    {
        "title": "The hot new stock right now is CLOV, I'm definitely buying in",
        "sentiment": "positive"
    },
    {
        "title": "The drop on RBLX is a great opportunity to buy in at a lower price",
        "sentiment": "positive"
    },
    {
        "title": "I'm confident that PLTR will rebound soon, it's a good buy right now",
        "sentiment": "positive"
    },
    {
        "title": "I'm cracking up at the amount of tendies I'm making on AMC!",
        "sentiment": "positive"
    },
    {
        "title": "Bagholding NOK and feeling bullish",
        "sentiment": "positive"
    },
    {
        "title": "My TSLA calls just printed tendies",
        "sentiment": "positive"
    },
    {
        "title": "Bought some undervalued AAPL puts",
        "sentiment": "positive"
    },
    {
        "title": "Citron Research just released a bearish report on PLTR",
        "sentiment": "negative"
    },
    {
        "title": "Hidenburg Research just exposed fraudulent practices at SOLO",
        "sentiment": "negative"
    },
    {
        "title": "Just sold my NOK shares, time to take some tendies",
        "sentiment": "positive"
    },
    {
        "title": "GME is gone, I'm out",
        "sentiment": "negative"
    },
    {
        "title": "Just bought some TSLA calls, let's go to the moon!",
        "sentiment": "positive"
    },
    {
        "title": "Paper hands panic selling their AMC shares",
        "sentiment": "negative"
    },
    {
        "title": "Just bought some bullish PLTR calls",
        "sentiment": "positive"
    },
    {
        "title": "This market is so sus right now, I'm staying on the sidelines",
        "sentiment": "negative"
    },
    {
        "title": "Shorting overvalued SPY",
        "sentiment": "positive"
    },
    {
        "title": "Buying undervalued QQQ shares",
        "sentiment": "positive"
    },
    {
        "title": "I'm long on AAPL, it's a solid company",
        "sentiment": "positive"
    },
    {
        "title": "Selling my bearish TSLA puts",
        "sentiment": "positive"
    },
    {
        "title": "This market is pumping, it's time to buy some calls",
        "sentiment": "positive"
    },
    {
        "title": "Just hit my stop loss on BB, this stock is a rip",
        "sentiment": "negative"
    },
    {
        "title": "Just got an upgrade from Goldman Sachs, time to buy some JNJ",
        "sentiment": "positive"
    },
    {
        "title": "Just got a downgrade from Morgan Stanley, time to sell my GE shares",
        "sentiment": "negative"
    },
    {
        "title": "Just bought some hot NOK calls, let's go!",
        "sentiment": "positive"
    },
    {
        "title": "Sus AF! Offering from $AMC to save the stonks!",
        "sentiment": "negative"
    },
    {
        "title": "Bullish $AAPL, tendies for everyone!",
        "sentiment": "positive"
    },
    {
        "title": "Bearish $TSLA, the bubble is going to burst soon",
        "sentiment": "negative"
    },
    {
        "title": "Bagholding $GME, hoping for a rebound",
        "sentiment": "negative"
    },
    {
        "title": "Paper hands got me out of $NVDA too early, missed out on tendies",
        "sentiment": "negative"
    },
    {
        "title": "Breaking news: $FB facing regulatory scrutiny, time to sell?",
        "sentiment": "negative"
    },
    {
        "title": "Long $NFLX, strong fundamentals and great content",
        "sentiment": "positive"
    },
    {
        "title": "Short $UBER, overvalued and facing tough competition",
        "sentiment": "negative"
    },
    {
        "title": "Put options on $SPY, market is due for a correction",
        "sentiment": "positive"
    },
    {
        "title": "Calls on $BABA, bullish on the Chinese e-commerce giant",
        "sentiment": "positive"
    },
    {
        "title": "Tendies all around with $AMZN hitting new highs",
        "sentiment": "positive"
    },
    {
        "title": "Suspected fraud at $LK, stock plummets",
        "sentiment": "negative"
    },
    {
        "title": "Hoping for a moonshot with $RKT, rocket emoji",
        "sentiment": "positive"
    },
    {
        "title": "Big money printing with $MSFT's cloud business",
        "sentiment": "positive"
    },
    {
        "title": "Bear market got me down, lost a lot on $BA",
        "sentiment": "negative"
    },
    {
        "title": "Bullish on $NVDA's AI technology, future looks bright",
        "sentiment": "positive"
    },
    {
        "title": "Just bought some $TSLA puts, Elon's tweets can't save it forever",
        "sentiment": "positive"
    },
    {
        "title": "RIP my portfolio with $PLTR's earnings miss",
        "sentiment": "negative"
    },
    {
        "title": "Time to GTFO of $SNAP, poor user growth and intense competition",
        "sentiment": "negative"
    },
    {
        "title": "Green day with $AAPL's impressive earnings report",
        "sentiment": "positive"
    },
    {
        "title": "Bearish on $DIS, theme parks struggling and streaming wars heating up",
        "sentiment": "negative"
    },
    {
        "title": "Hot stock alert: $PTON soaring on strong sales and growth prospects",
        "sentiment": "positive"
    },
    {
        "title": "Drop it like it's hot with $ROKU's disappointing guidance",
        "sentiment": "negative"
    },
    {
        "title": "Rebound potential with $BA after the recent dip",
        "sentiment": "positive"
    },
    {
        "title": "$AAPL and $TSLA cracking down on crypto mining, good for investors",
        "sentiment": "positive"
    },
    {
        "title": "Bullish on $GOOG's dominance in search and advertising",
        "sentiment": "positive"
    },    
    {
        "title": "This stock is cracking under pressure, I'm out",
        "sentiment": "negative"
    },
    {
        "title": "Just got an upgrade from Goldman Sachs, time to buy some JNJ",
        "sentiment": "positive"
    },
    {
        "title": "Just got a downgrade from Morgan Stanley, time to sell my GE shares",
        "sentiment": "negative"
    },
    {
        "title": "Just bought some hot NOK calls, let's go!",
        "sentiment": "positive"
    },
    {
        "title": "Sold all my GME shares and made a huge profit, time to cash out",
        "sentiment": "positive"
    },
    {
        "title": "Bought some undervalued TSLA shares, expecting big gains soon",
        "sentiment": "positive"
    },
    {
        "title": "Got burned on some overhyped AMC calls, time to cut my losses",
        "sentiment": "negative"
    },
    {
        "title": "Picked up some cheap AAPL puts, expecting a big drop soon",
        "sentiment": "positive"
    },
    {
        "title": "Holding onto my MSFT shares for the long term, solid company with great potential",
        "sentiment": "positive"
    },
    {
        "title": "Dumped all my F shares, not impressed with the company's performance",
        "sentiment": "negative"
    },
    {
        "title": "Bought into some promising SPY calls, hoping for a bull run",
        "sentiment": "positive"
    }      
]